package src.by.itacademy.hw3;

import java.util.Scanner;

public class Task7 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите челое число -> ");


    }
}

//7.	Пользователь вводит два целых однозначных числа.
// Программа задаёт вопрос: каков результат умножения первого числа на второе?
// Пользователь должен ввести ответ и увидеть на экране правильно он ответил или нет.
// Если нет  – показать еще и правильный результат.