package src.by.itacademy.hw2;

public class Task2 {
    public static void main (String args[]) {
        int x = sum(1, 2);

        System.out.println(x);

    }
    static int sum(int a, int b){
        return a + b + a * b;
    }
}


/* 2.	Написать метод, который принимает на вход два целых числа,
делает их суммирование и складывает результат с произведением двух этих чисел,
и возвращает полученный результат из метода.
Передать на вход в метод любые два числа.
Вывести полученный результат работы метода на экран. */

